brew "iterm2"
brew "fzf"
brew "bat"
brew "coreutils"
brew "git"
brew "curl"
brew "neofetch"
brew "eza"
brew "fd"
brew "htop"
brew "lesspipe"
brew "pwgen"
brew "zsh-completions"
brew "stow"
brew "entr"
brew "assh"

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
