# ------------------------------------------------------------------------------
# CLI
# ------------------------------------------------------------------------------
brew "mise"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "coreutils"
brew "neovim"
brew "git"
brew "curl"
brew "neofetch"
brew "eza"
brew "fd"
brew "htop"
brew "lesspipe"
brew "pwgen"
brew "zsh-completions"
brew "stow"
brew "entr"
brew "assh"
brew "gcal"
brew "neofetch"
brew "jq"

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask/GUI
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"

cask "iterm2"
cask "vlc"
cask "keepassxc"
cask "postman"
cask "obsidian"
# Copy/Paste buffer
cask "maccy"
cask "rectangle"
cask "android-file-transfer"
